In [1]:
import pandas as pd

In [2]:
data = [[1, 'Joe', 85000, 1], [2, 'Henry', 80000, 2], [3, 'Sam', 60000, 2], [4, 'Max', 90000, 1], [5, 'Janet', 69000, 1], [6, 'Randy', 85000, 1], [7, 'Will', 70000, 1]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
data = [[1, 'IT'], [2, 'Sales']]
department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

In [3]:
df = employee.merge(department, left_on = 'departmentId', right_on = 'id', suffixes = ['', '_dep']).drop(columns = ['departmentId', 'id_dep'])

In [4]:
indx = df.drop_duplicates('salary').groupby('name_dep').apply(lambda x: x.nlargest(3, 'salary')).drop(columns = 'name_dep').reset_index()[['salary']]

In [5]:
df

   id   name  salary name_dep
0   1    Joe   85000       IT
1   4    Max   90000       IT
2   5  Janet   69000       IT
3   6  Randy   85000       IT
4   7   Will   70000       IT
5   2  Henry   80000    Sales
6   3    Sam   60000    Sales

In [11]:
df.set_index(['salary', 'id']).loc[indx['salary']].reset_index()[['name_dep','name','salary']]

  name_dep   name  salary
0       IT    Max   90000
1       IT    Joe   85000
2       IT  Randy   85000
3       IT   Will   70000
4    Sales  Henry   80000
5    Sales    Sam   60000

In [7]:
indx['salary']

0    90000
1    85000
2    70000
3    80000
4    60000
Name: salary, dtype: Int64